// window.prompt("message");لعرض شاشة منبثقة للمستخدم بها حقل يمكن لمستخدم كتابة نص ضمنها
//----------------------------------------------------------------------------
// window.confirm("message");يتم استخدامها لعرض شاشة منبثة للمستخدم بها خيار تاكيد او الغاء           
//----------------------------------------------------------------------------
// Coder Shiyar - YouTube : http://youtube.com/codershiyar
//--------------------------------------------------------------------------
// var username = prompt("ضع اسم المستخدم : ");
// var password = prompt("ضع كلمة المرور");
// if(username === "admin1" && password ==="1234"){
// alert("بيانات صحيحة");
// }else{
//     alert("بيانات غير صحيحة");
// }


var confirm = confirm("هل انت متاكد انك ترغب بقيام بذلك");

if(confirm == true){
alert("قمت بنقر على موافق");
}