// Event          -        توضيح
// ---------------------------------------------
// click          -  يحدث الحدث عندما ينقر المستخدم على عنصر
// contextmenu    -  يحدث الحدث عندما ينقر المستخدم بزر الماوس الأيمن على عنصر لفتح قائمة السياق
// dblclick       - يحدث الحدث عندما ينقر المستخدم نقرًا مزدوجًا على عنصر
// mousedown      - يحدث الحدث عندما يضغط المستخدم على زر الماوس فوق عنصر
// mouseenter     - يحدث الحدث عند تحريك المؤشر إلى عنصر
// mouseleave     - يحدث الحدث عند تحريك المؤشر خارج عنصر
// mousemove      - يحدث الحدث عندما يتحرك المؤشر أثناء وجوده فوق عنصر
// mouseout       - يحدث الحدث عندما يحرك مستخدم مؤشر الماوس خارج عنصر أو خارج أحد العناصر التابعة له    
// mouseover      - يحدث الحدث عند تحريك المؤشر على عنصر ، أو على أحد توابعه
// mouseup        -يحدث الحدث عندما يقوم مستخدم بوضع اصبعته على زر الماوس فوق عنصر

document.getElementById("title").addEventListener("mouseup",()=>{
alert("تم تنفيذ الأوامر");
});