//JavaScript Objects - اوبجكت هي نسخة متطورة لتخزين البيانات في فاريبل واحد  بجافاسكربت 
// ---------------------------------------------------------------------
// {}  يتم إنشاء اوبجكت عبر امر 
//
// ---------------------------------------------------------------------
// key : value           وضمنها لتخزين بيانات ضمن اوبجكت  يكون بشكل تالي القوانين :    قيمة : مفتاح
// ---------------------------------------------------------------------
// يمكنك تخزين ضمن المفتاح : بيانات من نوع التالي  
// Arrays, boolean , String , Number , function Return , Objects 

var data = {
    name:"Coder Shiyar",
    age:20 ,
    working: true ,
     language: ["html","css","javscript"]  ,
    myFunction: function(){
        return 10 * 10
    } };
    data.name = "Coder Shiyar JavaScript";
// هنا قمنا بإنشاء مفتاح جديد وحددنا قيمة الذي نرغب بتخزينها ضمن المفتاح , وقمنا بإضافته للاوبجت المحدد
data.color = "Red";

// delete لحذف بيانات من اوبجكت كل ما عليك بتحديد اي قيمة ترغب بحذفها 
// الذي يتواجد ضمن اوبجكت الذي ترغب بحذف بيانات منها مثال:
// delete data.name;     هنا قمنا بحذف مفتاح نئم من اوبجكت مع بياناتها

// الطريقة الأول لعرض البيانات المخزنة ضمن مفاتيح في اوبجكت 
// object.key

// الطريقة الثانية لعرض البيانات المخزنة ضمن مفاتيح في اوبجكت 
// object["key"]

// مثال لطريقة عرض البيانات الموجودة ضمن اوبجكت - قد يفيدك اثناء البرمجة
console.log(data);

// مثال لطريقة لعرض بيانات المخزنة ضمن فاريبل الذي يتواجد ضمن احد مفاتيح في اوبجكت
console.log(data.name);
console.log(data["name"]);
// مثال لعرض بيانات المخزنة ضمن ارراي الذي يتواجد ضمن احد مفاتيح في اوبجكت
console.log(data.language[0]);
// مثال لطريقة استدعى فونكشن مخزن ضمن مفتاح في اوبجكت
console.log(data.myFunction());