// List of Events - رابط مواقعين ستجد به جميع افنتس
// -------------------------------------------------------------------------
// https://developer.mozilla.org/en-US/docs/Web/Events
// https://www.w3schools.com/jsref/dom_obj_event.asp    
// -------------------------------------------------------------------------
// Event -           -                            :يستخدم لتنفيذ الأوامر عند 
// -------------------------------------------------------------------------
// load             -             عند اكتمال تحميل موقع او للعنصر المحدد
// click            -    عندما يحدث نقر على العنصر الذي تم تزويده بالإفنت
// -------------------------------------------------------------------------
// addEventListener  - يتم استخدامها لتزويد عناصر الذي تحدده ب افنت الذي تحدده
// -------------------------------------------------------------------------
document.getElementById("text").addEventListener("click" , ()=>{
alert("تم  نقر على العنصر");
});


// document.getElementById("text").addEventListener("click" , function(){
//     alert("تم  نقر على العنصر");
//     });