var points = 95;

if (points >= 90) {
  alert("ممتاز");
} else if (points >= 80) {
  alert("جيد جدا");
} else if (points >= 70) {
  alert("جيد");
} else if (points >= 60) {
  alert("مقبول");
} else {
  alert("ضعيف");
}


//      إستخدامه     الرمز	
//      >	        علامة أكبر من
//      <	        علامة أصغر من
//      >=	        علامة أكبر من أو يساوي
//      <=	        علامة أصغر من أو يساوي
//      ==	        القيمتين متساويتين بغض النظر 
//                  عن نوع البيانات أي أن القيمة 1 تساوي القيمة '1'
//      !=	        القيمتين غير متساويتين
//      ===     	القيمتين متساويتين ومن نفس نوع البيانات أي أن القيمة 1 لا تساوي القيمة '1'
//      !==     	القيمتين غير متساويتين مع الأخذ في الإعتبار نوع البيانات