// ----------------------------------------------------------------------
// navigator.onLine  يستخدم لتحقق من إن كان مستخدم متصل بالانترنت او لا
// ----------------------------------------------------------------------
//    يقوم بإعادة صح او خطا,إذا كان مستخدم بالانترنت فسيقوم بإعادة صح
// true/false  
// ----------------------------------------------------------------------
//                       لتنفيذ اوامر عندما يصبح مستخدم متصل بالانترنت
// window.addEventListener('online',  );
// ----------------------------------------------------------------------
//                   لتنفيذ اوامر عندما يصبح مستخدم غير متصل بالانترنت
// window.addEventListener('offline', );
// ----------------------------------------------------------------------
let isOnline = navigator.onLine
console.log(isOnline)
window.onoffline = ()=>{
    alert("فقدت اتصال بالانترنت")
}
// window.addEventListener('offline',()=>{
//     alert("فقدت اتصال بالانترنت")
// } );

window.addEventListener('online',()=>{
    alert("انت متصل بالانترنت")
} );
