// Coder Shiyar   -   https://youtube.com/codershiyar
// -----------------------------------------------------------------------------
// Math.round(x)                          تُرجع قيمة x مقربة إلى أقرب عدد صحيح لها:
// Math.pow(x, y)                                            ترجع قيمة x إلى قوة y:
// Math.sqrt(x)                                          إرجاع الجذر التربيعي لـ x:
// Math.ceil(x)             تُرجع قيمة x مقربة إلى أقرب عدد صحيح   عبر زيادة قيمة:
// Math.floor(x)            تُرجع قيمة x مقربة إلى أقرب عدد صحيح   عبر نقص القيمة:
// Math.random();                          إرجاع رقم عشوائي بين 0 (ضمناً) و 1 (حصري):
// Math.min(x, y, z, ..., n)                   لجلب العدد الأصغر من بين مجموعة اعداد
// Math.max(x, y, z, ..., n)                   لجلب العدد الأكبر من بين مجموعة اعداد
// -----------------------------------------------------------------------------
// ستجد في الرابط التالي جميع عناصر يمكنك 
// استخدامها لاجل عمليات رياضيات في جافا سكريبت
// https://www.w3schools.com/jsref/jsref_obj_math.asp
