
// outerHTML يتم استخدامها لإستبدال عنصر المحدد مع القيمة الذي يتواجد ضمنها بقيمة جديدة
//             او يمكنك  استخدامها للحصول على العنصر المحدد مع القيمة الذي يتوجد ضمنها
// -----------------------------------------------------------------------------------------
// outerText    يتم استخدامها لإستبدال عنصر المحدد مع القيمة الذي يتواجد ضمنها بنص جديد
//                    او يمكنك  استخدامها للحصول على العنصر المحدد مع القيمة الذي يتوجد 
//                                                                           ضمنها بصيغة نص
// -----------------------------------------------------------------------------------------
// innerHTML  
//                                  يتم استخدامها لتعديل على القيمة العنصر المحدد
//                                   او  يمكنك استخدامها لعرض للمحتوى العنصر المحدد 
// -----------------------------------------------------------------------------------
// innerText 
//                             text يتم استخدامها لعرض العنصر المحدد على شكل نص
//                             text او  لتحديد قيمة جديدة للعنصر المحدد بصيغة نص
// ------------------------------------------------------------------------------------


let header = document.getElementById("header");
header.innerHTML = "<h2> انا احب جافاسكربت </h2>";
// alert(header.innerText);


































// Coder Shiyar - YouTube : http://youtube.com/codershiyar
// -----------------------------------------------------------

